// Это JSDoc - специальный комментарий, который говорит редактору кода: эта переменная должна быть типа NextConfig!
/** @type {import('next').NextConfig} */

const nextConfig = {
  //(для Next.js < 16)
  // eslint: { 
  //   // Только существующие папки
  //   // Какие папки проверять
  //   dirs: ["src/app", "src/ui"],
  //   // Проверка при сборке
  //   ignoreDuringBuilds: false,
  // },
  typescript: {
    // Проверка типов при сборке
    ignoreBuildErrors: false,
  },
  // Добавьте полезные опции
  // Когда true (по умолчанию):
  // HTTP Response Headers:
  // x-powered-by: Next.js  // 👎 Показываем хакерам наш стек
  
  // Когда false (как у нас):
  // HTTP Response Headers:
  // Нет заголовка x-powered-by  // 👍 Скрываем технологии
  poweredByHeader: false,
  // Для отлова багов
  reactStrictMode: true,
  // Для улучшения скорости сборки приложения (для Next.js < 16)
  // swcMinify: true,
  reactCompiler: true,
};

export default nextConfig;